
LEXICON_UA: dict[str, str] = {
    '/start': '🙌 <b>Привіт!</b>\n'
              'Це бот, за допомогою якого ти \n'
              'можеш дізнатися дату свого \n'
              'прибирання в Біблійній церкві в Варшаві ⛪️ \n'
              'Щоб подивитися список команд введи: <b>/help</b> \n'
              'або можеш скористатися кнопками внизу екрану ⬇︎',
    '/help': '<b>Дізнайся дату свого прибирання в '
             'Біблійній церкві в Варшаві ⛪️</b>\n\n'
             '<b>Доступні команди:</b>\n'
             '/search - пошук за допомогою Прізвища та Імені \n'
             'або тільки за допомогою Прізвища \n'
             '/show - показати суботній список прибиральників \n'
             '/schedule - Графік прибирання, \n'
             '©Created by Igor Radysiuk \n'
             '/help - довідка бота. \n\n'
             '<b>Внизу екрану також доступні кнопки ⬇︎</b>',
    '/search': 'Введи своє <b>Прізвище та Ім\'я</b> \n'
               'або тільки <b>Прізвище</b> \n'
               'літерами російського алфавіту. \n'
               'Наприклад: \n<i>Балога Михаил</i> \n<i>Балога</i>',
    '/show': 'Суботній список прибиральників',
    '/schedule': 'Графік прибирання. \n'
                 '©Created by Igor Radysiuk',
    '/cancel': 'Відміняти нічого',
    'cancel_search': 'Пошук покинуто❗️',
    'no_data': 'Ой лишенько 😟, нікого не знайшов. \n'
               'Перевір будь-ласка правильність \n'
               'введення твоїх даних. \n'
               '🔍Спробуй ще раз. \n'
               'Для виходу з Пошуку введи: <b>/cancel</b>',
    'bad_input': '🤔Щось це не схоже на Прізвище чи Ім\'я \n'
                 '🔍Спробуй ще раз. \n'
                 'Для виходу з Пошуку введи: <b>/cancel</b>',
    'successful_search': 'Для нового пошуку введи: \n'
                         '<b>/search</b> або натисни кнопку: \n🔍 <b>Пошук</b>',
    'other_answer': '❗Вибач, але мені незрозуміло це повідомення. \n'
                    'Введи: <b>/help</b> для довідки',
    'search_button': '🔍 Пошук',
    'show_all_button': '📃 Суботній список прибиральників',
    'schedule_link_button': '\n'.join(['🧑🏻‍💻Графік прибирання ', '©Created by Igor Radysiuk'])
}

LEXICON_COMMANDS: dict[str:str] = {
    '/search': 'Пошук по Прізвищу та Імені',
    '/show': 'Суботній список прибиральників',
    '/schedule': 'Графік прибирання \n'
                 '©Created by Igor Radysiuk',
    '/help': 'Довідка бота',
    '/cancel': 'Відмінити!'
}
